"use strict"
// Задача №1
// Що потрапить в консоль?

// let someVar = 0;
// ++someVar;

// if (someVar) {
// 	console.log(someVar);
// }

/*
Рішення - Задача №1:
1. Створюється змінна someVar і присвоюється їй число 0.
2. Змінна someVar збільшується на 1, після цього змінна someVar дорівнює 1.
3. if конвертує значення someVar в тип Boolean. Оскільки someVar число не нуль то if отримує true.
4. Виповнюється команда: console.log(someVar);
5. В консолі виводиться 1.
*/

// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.
/*
Рішення - Задача №2:
*/
console.log(`Рішення - Задача №2`);
for (let i = 1; i <= 10; i++) {
  console.log(`Пункт №${i}`);
}
console.log(``);

// Задача №3
// Що потрапить в консоль ?
// if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
// 	console.log('000');
// }
/*
Рішення - Задача №3:
1. (40 <= 10 || 15 < 5 && 10 <= 10 || 20 === "20")
2. (false || false && true || false)
3. (false || false || false)
4. В консоль нічого не виведеться.
*/

// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку
/*
Рішення - Задача №4:
*/
console.log(`Рішення - Задача №4`);
function divTwoNumbers(x, y) {
  let result = x / y;
  if (!isFinite(result)) {
    return `Некоректні вхідні дані`;
  }
  return `Результат ділення: ${result}`;
}

console.log(divTwoNumbers(10, 2)); // Результат ділення: 5
console.log(divTwoNumbers(123.0, 3)); // Результат ділення: 41
console.log(divTwoNumbers(123, "4")); // Результат ділення: 30.75
console.log(divTwoNumbers(10, 0)); // Некоректні вхідні дані
console.log(divTwoNumbers("x", "y")); // Некоректні вхідні дані
console.log(divTwoNumbers(5, null)); // Некоректні вхідні дані
console.log(divTwoNumbers(NaN, NaN)); // Некоректні вхідні дані
console.log(divTwoNumbers(Infinity, -Infinity)); // Некоректні вхідні дані
console.log(divTwoNumbers(-Infinity, 12)); // Некоректні вхідні дані
console.log(divTwoNumbers()); // Некоректні вхідні дані

console.log(``);

// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль
/*
Рішення - Задача №5:
*/
console.log(`Рішення - Задача №5`);
const array = [5, "8", 10, "abc", 20.2];

array.forEach((element) => {
  if (element === 10) {
    console.log(element); // 10
  }
});
